### Terraform Plan: `dev/base`
```
Acquiring state lock. This may take a few moments...
module.ssm_parameters.aws_ssm_parameter.this["AI_DB_URL"]: Refreshing state... [id=/doktori/dev/AI_DB_URL]
module.ssm_parameters.aws_ssm_parameter.this["AWS_S3_BUCKET_NAME"]: Refreshing state... [id=/doktori/dev/AWS_S3_BUCKET_NAME]
module.ssm_parameters.aws_ssm_parameter.this["GEMINI_MODEL"]: Refreshing state... [id=/doktori/dev/GEMINI_MODEL]
module.networking.data.aws_ami.nat_ubuntu: Reading...
data.aws_ami.nat_ubuntu: Reading...
module.ssm_parameters.aws_ssm_parameter.this["AWS_REGION"]: Refreshing state... [id=/doktori/dev/AWS_REGION]
module.ssm_parameters.aws_ssm_parameter.this["FIREBASE_SERVICE_ACCOUNT"]: Refreshing state... [id=/doktori/dev/FIREBASE_SERVICE_ACCOUNT]
module.ssm_parameters.aws_ssm_parameter.this["AWS_S3_ENDPOINT"]: Refreshing state... [id=/doktori/dev/AWS_S3_ENDPOINT]
module.storage.aws_s3_bucket.this["app"]: Refreshing state... [id=doktori-v2-dev]
module.ssm_parameters.aws_ssm_parameter.this["QUIZ_CACHE_TTL_SECONDS"]: Refreshing state... [id=/doktori/dev/QUIZ_CACHE_TTL_SECONDS]
module.networking.data.aws_ami.nat_ubuntu: Read complete after 1s [id=ami-067069a366ec13118]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_RABBITMQ_HOST"]: Refreshing state... [id=/doktori/dev/SPRING_RABBITMQ_HOST]
data.aws_ami.nat_ubuntu: Read complete after 1s [id=ami-0bbcd617c4dcdf5a7]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_API_BASE_URL_DEV"]: Refreshing state... [id=/doktori/dev/NEXT_PUBLIC_API_BASE_URL_DEV]
module.ssm_parameters.aws_ssm_parameter.this["ZOOM_ACCOUNT_ID"]: Refreshing state... [id=/doktori/dev/ZOOM_ACCOUNT_ID]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_VAPID_KEY"]: Refreshing state... [id=/doktori/dev/NEXT_PUBLIC_FIREBASE_VAPID_KEY]
module.ssm_parameters.aws_ssm_parameter.this["RECO_SCHEDULER_CRON"]: Refreshing state... [id=/doktori/dev/RECO_SCHEDULER_CRON]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_GA_ID"]: Refreshing state... [id=/doktori/dev/NEXT_PUBLIC_GA_ID]
module.ssm_parameters.aws_ssm_parameter.this["ECR_REGISTRY"]: Refreshing state... [id=/doktori/dev/ECR_REGISTRY]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_RABBITMQ_PASSWORD"]: Refreshing state... [id=/doktori/dev/SPRING_RABBITMQ_PASSWORD]
module.ssm_parameters.aws_ssm_parameter.this["DB_USERNAME"]: Refreshing state... [id=/doktori/dev/DB_USERNAME]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_PROJECT_ID"]: Refreshing state... [id=/doktori/dev/NEXT_PUBLIC_FIREBASE_PROJECT_ID]
module.ssm_parameters.aws_ssm_parameter.this["DB_URL"]: Refreshing state... [id=/doktori/dev/DB_URL]
module.ssm_parameters.aws_ssm_parameter.this["AWS_S3_ENABLED"]: Refreshing state... [id=/doktori/dev/AWS_S3_ENABLED]
module.ssm_parameters.aws_ssm_parameter.this["KAKAO_CLIENT_SECRET"]: Refreshing state... [id=/doktori/dev/KAKAO_CLIENT_SECRET]
module.ssm_parameters.aws_ssm_parameter.this["AWS_S3_DB_BACKUP"]: Refreshing state... [id=/doktori/dev/AWS_S3_DB_BACKUP]
module.ssm_parameters.aws_ssm_parameter.this["DB_NAME"]: Refreshing state... [id=/doktori/dev/DB_NAME]
module.ssm_parameters.aws_ssm_parameter.this["GEMINI_API_KEY"]: Refreshing state... [id=/doktori/dev/GEMINI_API_KEY]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_DATA_REDIS_PORT"]: Refreshing state... [id=/doktori/dev/SPRING_DATA_REDIS_PORT]
module.ssm_parameters.aws_ssm_parameter.this["AWS_DEPLOY_ROLE_ARN"]: Refreshing state... [id=/doktori/dev/AWS_DEPLOY_ROLE_ARN]
module.ssm_parameters.aws_ssm_parameter.this["ZOOM_CLIENT_ID"]: Refreshing state... [id=/doktori/dev/ZOOM_CLIENT_ID]
module.ssm_parameters.aws_ssm_parameter.this["KAKAO_REST_API_KEY"]: Refreshing state... [id=/doktori/dev/KAKAO_REST_API_KEY]
module.ssm_parameters.aws_ssm_parameter.this["RUNPOD_API_KEY"]: Refreshing state... [id=/doktori/dev/RUNPOD_API_KEY]
module.ssm_parameters.aws_ssm_parameter.this["REDIS_URL"]: Refreshing state... [id=/doktori/dev/REDIS_URL]
module.ssm_parameters.aws_ssm_parameter.this["AI_API_KEY"]: Refreshing state... [id=/doktori/dev/AI_API_KEY]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_API_KEY"]: Refreshing state... [id=/doktori/dev/NEXT_PUBLIC_FIREBASE_API_KEY]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_RABBITMQ_PORT"]: Refreshing state... [id=/doktori/dev/SPRING_RABBITMQ_PORT]
module.ssm_parameters.aws_ssm_parameter.this["JWT_SECRET"]: Refreshing state... [id=/doktori/dev/JWT_SECRET]
module.ssm_parameters.aws_ssm_parameter.this["MONGO_URI"]: Refreshing state... [id=/doktori/dev/MONGO_URI]
module.ssm_parameters.aws_ssm_parameter.this["RECO_SCHEDULER_TZ"]: Refreshing state... [id=/doktori/dev/RECO_SCHEDULER_TZ]
module.ssm_parameters.aws_ssm_parameter.this["SENTRY_AUTH_TOKEN"]: Refreshing state... [id=/doktori/dev/SENTRY_AUTH_TOKEN]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_MESSAGING_SENDER_ID"]: Refreshing state... [id=/doktori/dev/NEXT_PUBLIC_FIREBASE_MESSAGING_SENDER_ID]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_REDIS_HOST"]: Refreshing state... [id=/doktori/dev/SPRING_REDIS_HOST]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_REDIS_PORT"]: Refreshing state... [id=/doktori/dev/SPRING_REDIS_PORT]
module.ssm_parameters.aws_ssm_parameter.this["AI_BASE_URL"]: Refreshing state... [id=/doktori/dev/AI_BASE_URL]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_RABBITMQ_USERNAME"]: Refreshing state... [id=/doktori/dev/SPRING_RABBITMQ_USERNAME]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_CHAT_BASE_URL_DEV"]: Refreshing state... [id=/doktori/dev/NEXT_PUBLIC_CHAT_BASE_URL_DEV]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_CHAT_WS_PATH"]: Refreshing state... [id=/doktori/dev/NEXT_PUBLIC_CHAT_WS_PATH]
module.ssm_parameters.aws_ssm_parameter.this["DISCORD_WEBHOOK_URL"]: Refreshing state... [id=/doktori/dev/DISCORD_WEBHOOK_URL]
module.ssm_parameters.aws_ssm_parameter.this["RECO_SCHEDULER_TOP_K"]: Refreshing state... [id=/doktori/dev/RECO_SCHEDULER_TOP_K]
module.ssm_parameters.aws_ssm_parameter.this["KAKAO_CLIENT_ID"]: Refreshing state... [id=/doktori/dev/KAKAO_CLIENT_ID]
module.ssm_parameters.aws_ssm_parameter.this["ZOOM_CLIENT_SECRET"]: Refreshing state... [id=/doktori/dev/ZOOM_CLIENT_SECRET]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_STORAGE_BUCKET"]: Refreshing state... [id=/doktori/dev/NEXT_PUBLIC_FIREBASE_STORAGE_BUCKET]
module.ssm_parameters.aws_ssm_parameter.this["RUNPOD_POLL_TIMEOUT_SECONDS"]: Refreshing state... [id=/doktori/dev/RUNPOD_POLL_TIMEOUT_SECONDS]
module.ssm_parameters.aws_ssm_parameter.this["RUNPOD_POLL_INTERVAL_SECONDS"]: Refreshing state... [id=/doktori/dev/RUNPOD_POLL_INTERVAL_SECONDS]
module.ssm_parameters.aws_ssm_parameter.this["KAKAO_FRONTEND_REDIRECT"]: Refreshing state... [id=/doktori/dev/KAKAO_FRONTEND_REDIRECT]
module.ssm_parameters.aws_ssm_parameter.this["RUNPOD_ENDPOINT_ID"]: Refreshing state... [id=/doktori/dev/RUNPOD_ENDPOINT_ID]
module.ssm_parameters.aws_ssm_parameter.this["RECO_SCHEDULER_SEARCH_K"]: Refreshing state... [id=/doktori/dev/RECO_SCHEDULER_SEARCH_K]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_APPID"]: Refreshing state... [id=/doktori/dev/NEXT_PUBLIC_FIREBASE_APPID]
module.ssm_parameters.aws_ssm_parameter.this["QODANA_TOKEN"]: Refreshing state... [id=/doktori/dev/QODANA_TOKEN]
module.ssm_parameters.aws_ssm_parameter.this["ENABLE_RECO_SCHEDULER"]: Refreshing state... [id=/doktori/dev/ENABLE_RECO_SCHEDULER]
module.ssm_parameters.aws_ssm_parameter.this["KAKAO_REDIRECT_URI"]: Refreshing state... [id=/doktori/dev/KAKAO_REDIRECT_URI]
module.ssm_parameters.aws_ssm_parameter.this["NEXT_PUBLIC_FIREBASE_AUTH_DOMAIN"]: Refreshing state... [id=/doktori/dev/NEXT_PUBLIC_FIREBASE_AUTH_DOMAIN]
module.networking.aws_eip.nat["primary"]: Refreshing state... [id=eipalloc-062b606ffff92b459]
module.networking.aws_vpc.main: Refreshing state... [id=vpc-0d77fef37669dc1c0]
module.ssm_parameters.aws_ssm_parameter.this["SPRING_DATA_REDIS_HOST"]: Refreshing state... [id=/doktori/dev/SPRING_DATA_REDIS_HOST]
module.storage.aws_s3_bucket_cors_configuration.this["app"]: Refreshing state... [id=doktori-v2-dev]
module.storage.aws_s3_bucket_public_access_block.this["app"]: Refreshing state... [id=doktori-v2-dev]
module.storage.aws_s3_object.folders["app/images/chats/"]: Refreshing state... [id=images/chats/]
module.storage.aws_s3_object.folders["app/images/reviews/"]: Refreshing state... [id=images/reviews/]
module.storage.aws_s3_object.folders["app/images/profiles/"]: Refreshing state... [id=images/profiles/]
module.storage.aws_s3_object.folders["app/backup/"]: Refreshing state... [id=backup/]
module.storage.aws_s3_object.folders["app/images/meetings/"]: Refreshing state... [id=images/meetings/]
module.storage.aws_s3_bucket_versioning.this["app"]: Refreshing state... [id=doktori-v2-dev]
module.storage.aws_s3_bucket_server_side_encryption_configuration.this["app"]: Refreshing state... [id=doktori-v2-dev]
module.storage.aws_s3_bucket_policy.this["app"]: Refreshing state... [id=doktori-v2-dev]
module.networking.aws_route53_zone.internal: Refreshing state... [id=Z08439973IDNFFVG0N43A]
module.networking.aws_internet_gateway.main: Refreshing state... [id=igw-00facfe2199af81fa]
module.networking.aws_route_table.private["primary"]: Refreshing state... [id=rtb-007b1826a1715b5da]
module.networking.aws_security_group.nat: Refreshing state... [id=sg-0a05c670a5efa2c39]
module.networking.aws_subnet.this["public"]: Refreshing state... [id=subnet-05621a464006280c3]
module.networking.aws_subnet.this["private_app"]: Refreshing state... [id=subnet-07b63a3183c737d91]
module.networking.aws_subnet.this["private_db"]: Refreshing state... [id=subnet-0f71720fec2f14772]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-0489ce78da442e378]
module.networking.aws_instance.nat["primary"]: Refreshing state... [id=i-05572ce5853c4d38a]
module.networking.aws_route_table_association.this["private_db"]: Refreshing state... [id=rtbassoc-0409653bd618d6166]
module.networking.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-0b047ecb4ee9aed19]
module.networking.aws_route_table_association.this["public"]: Refreshing state... [id=rtbassoc-0458d43542085b1d2]
module.networking.aws_route_table_association.this["private_app"]: Refreshing state... [id=rtbassoc-00336a3e79d14d1e5]
module.networking.aws_eip_association.nat["primary"]: Refreshing state... [id=eipassoc-02a2303703bd2de05]
module.networking.aws_route.private_nat["primary"]: Refreshing state... [id=r-rtb-007b1826a1715b5da1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.networking.aws_iam_instance_profile.nat[0] will be created
  + resource "aws_iam_instance_profile" "nat" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "doktori-dev-nat-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "doktori-dev-nat-role"
      + tags_all    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "doktori"
        }
      + unique_id   = (known after apply)
    }

  # module.networking.aws_iam_role.nat[0] will be created
  + resource "aws_iam_role" "nat" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "doktori-dev-nat-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "doktori-dev-nat-role"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "doktori-dev-nat-role"
          + "Project"     = "doktori"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.networking.aws_iam_role_policy_attachment.nat_ssm[0] will be created
  + resource "aws_iam_role_policy_attachment" "nat_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "doktori-dev-nat-role"
    }

  # module.networking.aws_instance.nat["primary"] will be updated in-place
  ~ resource "aws_instance" "nat" {
      ~ iam_instance_profile                 = "doktori-nonprod-ec2-ssm" -> "doktori-dev-nat-profile"
        id                                   = "i-05572ce5853c4d38a"
        tags                                 = {
            "AutoStop" = "false"
            "Name"     = "doktori-dev-nat-vpn"
            "Service"  = "nat-vpn"
        }
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```